package io.hexaforce.dievas.commons.exception;

import lombok.AllArgsConstructor;
import lombok.Getter;

@Getter
@AllArgsConstructor
public enum DievasErrorCode {
	
	/*********************************************************
	 * 
	 *********************************************************/
	COMMONS_ERROR(1000,"ライブラリエラー"),

	
	
	
	
	
	/*********************************************************
	 * 
	 *********************************************************/
	DATABASE_ERROR(2000,"データ層ロジックエラー"),

	
	
	
	
	
	
	
	/*********************************************************
	 * 
	 *********************************************************/
	BATCH_ERROR(3000,"バッチエラー"),

	
	
	
	
	
	
	
	
	
	/*********************************************************
	 * 
	 *********************************************************/
	SERVICE_ERROR(4000,"ビジネスロジック層エラー"),

	
	
	
	
	
	
	
	/*********************************************************
	 * ネットワーク層からリクエスト、レストに起因するエラー
	 *********************************************************/
	WEBAPP_ERROR(5000,"WEB層ロジックエラー"),
	SESSION_LOST(5001,"セッションが切れました。"),
	
	

	/*********************************************************
	 * 環境依存に起因するエラー
	 *********************************************************/
	ENVIRONMENT_ERROR(9000,"環境依存エラー");
	
	
	private int code;
	private String message;
	
}
